---
kind: method
id: M:Autodesk.Revit.DB.ViewScheduleExportOptions.#ctor(Autodesk.Revit.DB.ViewScheduleExportOptions)
source: html/739f5f63-d6c4-63ee-9a2f-235b264f9ed3.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.#ctor Method

Constructs a new copy of the input ViewScheduleExportOptions object.

## Syntax (C#)
```csharp
public ViewScheduleExportOptions(
	ViewScheduleExportOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ViewScheduleExportOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null